## Построение гистограммы. Для предсказания каждого полиморфизма выбирается максимальная вероятность образования/нарушения СС.Строится гистограмма
## распределения предсказаний по максимальным вероятностям.
import matplotlib.pyplot as plt
# gnom = open('all_gnom_variants_pred_filtr.vcf','r')
# for i in range(45):
#     zag = gnom.readline()
# freq = {}
# for i in range(100):
#     if ((i+1)%10 == 0):
#         freq[str((i+1)/100)+'0']=0
#         continue
#     freq[str((i+1)/100)]=0
# print(freq.keys())
# for st in gnom:
#     stm = st[0:-1].split('\t')
#     fl = 0
#     try:
#         info = stm[7]
#     except IndexError:
#         continue
#     try:
#         spliceai = info.split(';')[3]
#     except IndexError:
#         continue
#     probab = spliceai.split('|')
#     try:
#         re = probab[5]
#     except IndexError:
#         continue
#     mmax = '-1'
#     for j in range(2,6):
#         if float(probab[j]) > float(mmax):
#             mmax = probab[j]
#     freq[mmax]+=1
# pr = []
# fr = []
# for k in freq.keys():
#     pr.append(k)
#     fr.append(freq[k])
# print(pr)
# print(fr)
# gnom.close()
pr = ['0.01', '0.02', '0.03', '0.04', '0.05', '0.06', '0.07', '0.08', '0.09', '0.10', '0.11', '0.12', '0.13', '0.14', '0.15', '0.16', '0.17', '0.18', '0.19', '0.20', '0.21', '0.22', '0.23', '0.24', '0.25', '0.26', '0.27', '0.28', '0.29', '0.30', '0.31', '0.32', '0.33', '0.34', '0.35', '0.36', '0.37', '0.38', '0.39', '0.40', '0.41', '0.42', '0.43', '0.44', '0.45', '0.46', '0.47', '0.48', '0.49', '0.50', '0.51', '0.52', '0.53', '0.54', '0.55', '0.56', '0.57', '0.58', '0.59', '0.60', '0.61', '0.62', '0.63', '0.64', '0.65', '0.66', '0.67', '0.68', '0.69', '0.70', '0.71', '0.72', '0.73', '0.74', '0.75', '0.76', '0.77', '0.78', '0.79', '0.80', '0.81', '0.82', '0.83', '0.84', '0.85', '0.86', '0.87', '0.88', '0.89', '0.90', '0.91', '0.92', '0.93', '0.94', '0.95', '0.96', '0.97', '0.98', '0.99', '1.00']
fr = [4257636, 1549544, 857175, 552799, 386897, 285406, 218849, 172045, 138764, 113480, 94877, 79954, 67679, 58131, 50255, 43663, 38055, 33797, 29836, 26536, 23755, 21517, 19164, 17329, 15966, 14389, 12900, 12021, 11104, 10185, 9460, 8819, 8282, 7453, 6995, 6328, 6111, 5751, 5282, 5018, 4834, 4470, 4145, 4024, 3696, 3609, 3472, 3383, 3121, 2959, 2907, 2712, 2641, 2445, 2366, 2307, 2235, 2094, 2113, 1999, 1948, 1852, 1825, 1778, 1732, 1645, 1583, 1483, 1528, 1462, 1423, 1313, 1344, 1300, 1256, 1276, 1266, 1293, 1183, 1135, 1121, 1115, 1101, 1075, 1107, 1086, 1155, 1071, 1125, 1150, 1125, 1084, 1224, 1343, 1543, 1845, 2297, 3335, 6348, 4342]
S = sum(fr)
frp=[]
for el in fr:
    frp.append(el/S)
for el in frp:
    print('{:.2}'.format(round(el,2)),end=' ')
fif = open('freq_gnom.txt','w')
fif.write('#MAX_PROBABILITY\tAMOUNT\tFREQUENCY\n')
for p,fp in zip(pr,fr):
    fif.write('{}\t{}\t{:.2}\n'.format(p,fp,round(fp/S,2)))

fif.close()
# plt.bar(pr[2::3],fr[2::3])
# plt.grid(True)
# plt.show()